my_list = ['киви', 'банан', 'апельсин', 'авокадо', 'яблоко']
print('мой список: ', my_list)
print('первый и последний элемент: ', my_list[0], my_list[-1])
print('элементы с третьего по пятый: ', my_list[2:4])
my_list[2] = 'дуриан'
print('измененный список: ', my_list)
#
my_dict = {'text' : 'текст', 'word' : 'слово', 'dot' : 'точка', 'case' : 'случай', 'lock' : 'запирать'}
print('мой словарь: ', my_dict)
print('значение элемента словаря: ', my_dict['word'])
my_dict['word'] = 'тоже слово'
print('измененный словарь: ', my_dict)