my_dict = {'степан' : 1999, 'феодор' : 2001, 'евлампий' : 1117, 'мафусаил' : -7099, 'воланд' : 33}
print('словарь: ', my_dict)
print('значение элемента "феодор": ', my_dict['феодор'], ', ', my_dict.get('сигизмунд','сигизмунд - такого ключа нет'), sep = '')
#
my_dict ['иван'] = 1212
my_dict ['петр'] = 2024
print('удаленное значение: ', my_dict.pop('евлампий'))
print('новый словарь: ', my_dict)
#
print('')
my_set = {1, False, 'космос', False, 1, 2, 3, 3}
print('мое множество: ', my_set)
my_set.add('тень')
my_set.add(2.1)
my_set.remove(1)
print('новое множество: ', my_set)